Revit 2027 API
Result Enumeration
Informs Autodesk Revit of the status of your application after execution.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum Result
Public Enumeration Result
public enum class Result
type Result
Members
Member name | Value | Description
Cancelled | 1 | Signifies that the external application is cancelled.
Failed | -1 | The external application was unable to complete its task.
Succeeded | 0 | The external application completed successfully. Autodesk Revit will keep this object during the entire Revit session.
See Also
Reference
Autodesk.Revit.UI Namespace